FA2/app/Controllers/Customers.php

    public function index()
    {
        $model = new CustomerModel();
        $dbCustomers = $model->findAll();
---
SELECT *
FROM `customers`