FA3/app/Controllers/Customers.php

    public function index()
    {
        $model = new CustomerModel();
        return view('customers', ['customers' => $model->findAll()]);
---
SELECT *
FROM `customers`

    public function edit($id)
    {
        $model = new CustomerModel();
        $customer = $model->find($id);
---
SELECT *
FROM `customers`
WHERE `customers`.`id` = '4'

    public function update($id)
    {
        $model = new CustomerModel();

        if (! $model->find($id)) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Customer not found');
        }
        if (! $this->validate($this->rules)) {
            return redirect()->back()->withInput();
        }

        $model->update($id, [
            'full_name' => $this->request->getPost('full_name'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phone')
        ]);
---
SELECT *
FROM `customers`
WHERE `customers`.`id` = '4'
UPDATE `customers` SET `full_name` = 'Maria Clara', `email` = 'mariaclara@example.com', `phone` = '09204444444'
WHERE `customers`.`id` IN ('4')