FA3/app/Controllers/Users.php

    public function index()
    {
        $model = new UserModel();
        return view('users', ['users' => $model->findAll()]);
---
SELECT *
FROM `users`