FA4/app/Controllers/Auth.php

    public function attempt()
    {
        $rules = [
            'username' => 'required',
            'password' => 'required',
        ];
        if (! $this->validate($rules)) {
            return redirect()->back()->withInput();
        }

        $model    = new UserModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $user     = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin_01'
 LIMIT 1