FA4/app/Controllers/Users.php

SELECT *
FROM `users`
---
    public function index()
    {
        $model = new UserModel();
        return view('users', ['users' => $model->findAll()]);