TSA1/app/Controllers/MainController.php

SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-30'
---
    public function welcome()
    {
        $taskModel = new TaskModel();
        $data['tasks'] = $taskModel->
        where('task_date', date('Y-m-d'))->findAll();

SELECT *
FROM `tasks`
ORDER BY `task_date` ASC
---
    public function tasks()
    {
        $taskModel = new TaskModel();
        $data['tasks'] = $taskModel->orderBy('task_date', 'ASC')->findAll();