TSA2/app/Models/TaskModel.php

    public function getToday()
    {
        return $this
        ->where('task_date', date('Y-m-d'))
        ->where('is_archived', 0)
        ->orderBy('id', 'ASC')
        ->findAll();
---
SELECT *
FROM `tasks`
WHERE `task_date` = '2026-10-09'
AND `is_archived` = 0
ORDER BY `id` ASC

    public function getAllActive()
    {
        return $this
        ->where('is_archived', 0)
        ->orderBy('task_date', 'ASC')
        ->orderBy('id', 'ASC')
        ->findAll();
---
SELECT *
FROM `tasks`
WHERE `is_archived` = 0
ORDER BY `task_date` ASC, `id` ASC