TSA2/app/Controllers/Pages.php

SELECT *
FROM `users`
 LIMIT 1
---
    public function profile()
    {
        $user = (new UserModel())->first();